In [1]:
import pandas as pd
train = pd.read_csv('http://bit.ly/kaggletrain')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# map
train['Sex_num'] = train.Sex.map({'female':0, 'male':1})

In [3]:
train.loc[0:4, ['Sex', 'Sex_num']]

      Sex  Sex_num
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

In [4]:
# apply
train['Name_length'] = train.Name.apply(len)

In [5]:
train.loc[0:4, ['Name', 'Name_length']]

                                                Name  Name_length
0                            Braund, Mr. Owen Harris           23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           51
2                             Heikkinen, Miss. Laina           22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)           44
4                           Allen, Mr. William Henry           24

In [7]:
import numpy as np
train['Fare_ceil'] = train.Fare.apply(np.ceil)
train.loc[0:4, ['Fare', 'Fare_ceil']]

      Fare  Fare_ceil
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0
3  53.1000       54.0
4   8.0500        9.0

In [8]:
# apply自定义函数
train.Name.str.split(',').head()
# 结果是含有list的Series
# 如何从list中获取每个乘客的名字？名字是first name,逗号前面

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
Name: Name, dtype: object

In [9]:
def get_element(my_list, position):
    return my_list[position]

In [11]:
train.Name.str.split(',').apply(get_element, position = 0).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [12]:
# 同样可以用行内函数lambda
train.Name.str.split(',').apply(lambda x:x[0]).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [15]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [16]:
drinks.loc[:, 'beer_servings':'wine_servings'].apply(max, axis = 0)

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [17]:
drinks.loc[0:10, 'beer_servings':'wine_servings'].apply(max, axis = 1)

0       0
1     132
2      25
3     312
4     217
5     128
6     221
7     179
8     261
9     279
10     46
dtype: int64

In [18]:
# np.argmax, np.arg...
# 不是得到最大的值，而是得到最大值对应的特征（可以是最大值，也可以是最小值等等。。。）
drinks.loc[0:10, 'beer_servings':'wine_servings'].apply(np.argmax, axis = 1)

0       beer_servings
1     spirit_servings
2       beer_servings
3       wine_servings
4       beer_servings
5     spirit_servings
6       wine_servings
7     spirit_servings
8       beer_servings
9       beer_servings
10    spirit_servings
dtype: object

In [19]:
# applymap(function name)
# 把function作用到数据集中每一个元素
drinks.loc[0:10, 'beer_servings':'wine_servings'].applymap(float)
# float：把元素的类型转换成浮点数

    beer_servings  spirit_servings  wine_servings
0             0.0              0.0            0.0
1            89.0            132.0           54.0
2            25.0              0.0           14.0
3           245.0            138.0          312.0
4           217.0             57.0           45.0
5           102.0            128.0           45.0
6           193.0             25.0          221.0
7            21.0            179.0           11.0
8           261.0             72.0          212.0
9           279.0             75.0          191.0
10           21.0             46.0            5.0

In [20]:
# 可以用来改写原来的数据集
drinks.loc[:, 'beer_servings':'wine_servings'] = drinks.loc[:, 'beer_servings':'wine_servings'].applymap(float)
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0.0,0.0,0.0,0.0,Asia
1,Albania,89.0,132.0,54.0,4.9,Europe
2,Algeria,25.0,0.0,14.0,0.7,Africa
3,Andorra,245.0,138.0,312.0,12.4,Europe
4,Angola,217.0,57.0,45.0,5.9,Africa